proposals/proposal_environment.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Pallet Proposal -- Environment</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-21 12:57:27 EST"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Pallet environment proposal"/>
<meta name="keywords" content="pallet environment parameters"/>
<link rel="stylesheet" type="text/css" href="doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>
<link rel="stylesheet" type="text/css" href="../doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Pallet Proposal &ndash; Environment</h1>

<p>WARNING: This is a proposal
</p>
<p>
When switching environments (i.e. from development to test to stage to
production) you do not want to update the node definitions, etc.
</p>
<p>
Environment specific values can be accessed using the environment concept.  The
environment concept is impemented is a parameter used in converge/lift, for
example: (converge &hellip;.. :environment dev-env), and propogated as
the :environment key in the request map.
</p>
<p>
The effective environment is made available to crates through the standard keys.
</p>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">:environment </h2>
<div class="outline-text-2" id="text-1">


<p>
:templates
node templates for each tag, keyed by tag.  If not specified for
a given tag, then falls back to the definition in the defnode for
the tag.
</p>
<p>
:admin-user
a default admin user for the environment. If not specified, then
falss back on the :user passed to converge/lift.
</p>
<p>
:admin-users
admin-user for each tag.  If not specified for a given tag, then
falls back on the :admin-user for the environment.
</p>
<p>
:compute-services
compute services to use for each tag, keyed by tag. If not specified
for a given tag, then uses the :compute value passed to converge/lift
</p>
<p>
:blobstore-services
blobstore services to use for each tag, keyed by tag. If not specified
for a given tag, then uses the :blobstore value passed to converge/lift
</p>
<p>
:userdata
arbitrary data to be used by crates and node definitions. Not
interpreted by pallet.core.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">effective keys </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1">converge and other phases </h3>
<div class="outline-text-3" id="text-2_1">

<p>:user
:compute
:blobstore
</p>
</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2">bootstrap </h3>
<div class="outline-text-3" id="text-2_2">

<p>:target-count
:node-template
:user
:compute
:blobstore
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2011-01-21 12:57:27 EST</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
